[
  {
    "title": "Financial Control System",
    "description": "A personal finance management system that tracks income and expenses and generates monthly insights.",
    "entireDescription": "This personal project was created to help organize my monthly income and expenses. The system allows users to register earnings and spendings, visualize data through detailed reports, and receive insights about their financial habits. It includes JWT-based authentication and uses Supabase as the main database for storing all records.",
    "tags": ["Full Stack", "Node.js", "Bootstrap"],
    "images": ["img1.png", "img2.png", "img3.png", "img4.png"],
    "link": "https://github.com/paulowelton/Sistema-de-Controle-de-Financas"
  },
  {
    "title": "Telegram Downloader Bot",
    "description": "A Telegram bot that downloads YouTube audio or video and returns the file directly to the user.",
    "entireDescription": "This automation was designed to simplify how I download music and videos from YouTube. The bot receives a YouTube link, allows the user to choose between audio or video, processes the download, and sends the final file back via Telegram.",
    "tags": ["RPA", "Python", "Telegram"],
    "images": ["img1.png", "img2.png"],
    "link": "https://github.com/paulowelton/bot_telegram_youtube"
  },
  {
    "title": "Cosco Scraper Bot",
    "description": "Automation bot that scrapes shipment and container data from the Cosco website.",
    "entireDescription": "This automation was developed for a client to streamline the process of collecting maritime shipment information. On each execution, the bot reads a list of BL numbers, searches them on the Cosco website, extracts all relevant data, and saves the results in an XLSX file for easy access and tracking.",
    "tags": ["RPA", "Python", "Selenium"],
    "images": ["img1.png"],
    "link": "https://github.com/paulowelton/bot_cosco_scraper"
  },
  {
    "title": "Product Price Tracker",
    "description": "Desktop tool that searches for product promotions across multiple e-commerce websites.",
    "entireDescription": "This desktop application receives a target product and performs scraping across various e-commerce stores, collecting prices and product links. It displays the results in an organized, low-to-high price table and also allows exporting the data to an XLSX file.",
    "tags": ["RPA", "Python", "Selenium", "Tkinter", "Pandas", "Desktop"],
    "images": ["img1.png"],
    "link": "https://github.com/paulowelton/bot_procurar_promocoes"
  },
  {
    "title": "Space Shooter Game",
    "description": "A simple retro-style 2D space shooter built with Python and Pygame.",
    "entireDescription": "A small 2D space shooter game created to practice Python, game logic, and object-oriented programming. It includes player movement, enemies, projectiles, collision detection, score tracking, and basic animations.",
    "tags": ["Python", "Game Dev", "Pygame"],
    "images": ["img1.png"],
    "link": "https://github.com/paulowelton/space_shooter"
  }
]
